x = int(input()) # Преобразуем введеную строку в целое число
if 1 <= x <= 3: # Условие для "n" числа
    print('I' * x)
elif x == 4: # Условие для "n" числа
    print('IV')
elif 5 <= x <= 8: # Условие для "n" числа
    print('V' + (x - 5) * 'I')
elif x == 9: # Условие для "n" числа
    print('IX')
elif 10 <= x <= 13: # Условие для "n" числа
    print('X' + (x - 10) * 'I')
elif x == 14: # Условие для "n" числа
    print('XIV')
elif 15 <= x <= 18: # Условие для "n" числа
    print('XV' + (x - 15) * 'I')
elif x == 19: # Условие для "n" числа
    print('XIX')
elif 20 <= x <= 23: # Условие для "n" числа
    print('XX' + (x - 20) * 'I')
elif x == 30: # Условие для "n" числа
    print('XXX')
elif x == 40: # Условие для "n" числа
    print('XL')
elif x == 50: # Условие для "n" числа
    print('L')



